{"backend": "tensorflow", "config": [{"config": {"trainable": true, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-38-c9c1c082a98f>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw", "dtype": "float32", "output_shape": null, "batch_input_shape": [null, 16, 32, 1], "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "dtype": "float32", "padding": "valid", "kernel_constraint": null, "batch_input_shape": [null, 16, 32, 1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "filters": 2, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "strides": [4, 4], "data_format": "channels_last", "padding": "valid", "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.3"}